In [1]:
import numpy as np
import pandas as pd

In [2]:
data = [[1.0,5.0,1],[2.0,np.nan,2],[np.nan,np.nan,3]]
df = pd.DataFrame(data,index='0 1 2'.split(),columns='A B C'.split())
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [3]:
df2 = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[5,np.nan,np.nan],
                   'C':[1,2,3]})
df2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna(axis=1)
# axix = 0 은 행
# axis = 1 은 열
# NaN이 있는 컬럼을 제외하고

   C
0  1
1  2
2  3

In [5]:
df.dropna(thresh=1)
# 행 중에 정상적인 것이 1개 이상이면 표시

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna(thresh=2)
# 행 중에 정상적인 것이 2개 이상이면 표시

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [7]:
df.dropna(thresh=3)
# 행 중에 정상적인 것이 3개 이상이면 표시

     A    B  C
0  1.0  5.0  1

In [8]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [9]:
df.fillna(value=4)

     A    B  C
0  1.0  5.0  1
1  2.0  4.0  2
2  4.0  4.0  3

In [10]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64